# Основы pandas

In [5]:
import pandas as pd

In [8]:
pd.read_html("http://www.cbr.ru/")[4] # можно загрузить табилцы с html

                              0         1         2          3
0                             %    1 день  2-7 дней  8-30 дней
1          MIACR  за 16.08.2019     ↑7,07         —          —
2          RUONIA за 16.08.2019     ↑7,05       NaN        NaN
3                             %    1 день  1 неделя    1 месяц
4  MosPrime Rate  на 19.08.2019       737     ↑7,41        746
5                             %  1 неделя  2 недели    1 месяц
6         ROISfix на 19.08.2019     ↓7,12     ↓7,12      ↓7,12

In [54]:
data = pd.read_csv('power.csv')
data.head(5)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [55]:
data.tail(5)

          country  year  quantity  category
1189477  Viet Nam  2012      92.0        71
1189478  Viet Nam  2011      87.0        71
1189479  Viet Nam  2010      50.0        71
1189480  Viet Nam  2009      10.0        71
1189481  Viet Nam  2008       1.0        71

In [53]:
data["year_plus_one"] = data["year"] + 1
data.head()

   country  year  quantity  category  year_plus_one
0  Austria     1       5.0         1              2
1  Austria     1      17.0         1              2
2  Belgium     1       0.0         1              2
3  Belgium     1       0.0         1              2
4  Belgium     1      35.0         1              2

In [24]:
# data.columns = ["","",""]

In [39]:
type(data)

pandas.core.frame.DataFrame

In [18]:
# если надо указать свои заголовки и разделитель. Работает, если что-то поехало, отсутствуют заголовки и т.д.
# data = pd.read_csv('power.csv', names = ['страна', 'год', 'количество', 'категория'], sep = '\t', header=0)
# data.head()

In [40]:
# количество строк в датафрейме
len(data)

1189482

In [41]:
# или так
data.shape

(1189482, 5)

### Упражнение
Вам дана статистика продаж в файле transactions.csv. Вам необходимо загрузить этот файл в датафрейм и посчитать его размеры.

In [45]:
data_2 = pd.read_csv('transactions.csv')
data_2.shape

(60, 8)

### Основные сведения о датафрейме

In [46]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 5 columns):
country          1189482 non-null object
year             1189482 non-null int64
quantity         1189482 non-null float64
category         1189482 non-null int64
year_plus_one    1189482 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 45.4+ MB

In [48]:
# немного статистики

data.describe()

            year      quantity      category  year_plus_one
count  1189482.0  1.189482e+06  1.189482e+06      1189482.0
mean         1.0  1.842648e+05  3.624763e+01            1.0
std          0.0  1.585663e+07  1.809968e+01            0.0
min          1.0 -8.643480e+05  1.000000e+00            1.0
25%          1.0  1.400000e+01  2.400000e+01            1.0
50%          1.0  1.890000e+02  3.500000e+01            1.0
75%          1.0  2.265000e+03  5.100000e+01            1.0
max          1.0  6.680329e+09  7.100000e+01            1.0

### Отдельный столбец

In [56]:
data['year'].head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [64]:
# или так

data.year.head()

0    1996
1    1995
2    2014
3    2013
4    2012
Name: year, dtype: int64

In [65]:
type(data['year'])

pandas.core.series.Series

In [66]:
# уникальные значения в столбце

data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [60]:
len(data['category'].unique())

71

In [68]:
data['category'].head()

0    1
1    1
2    1
3    1
4    1
Name: category, dtype: int64

In [69]:
# распределение количества строк по значениям столбца

data['category'].value_counts().tail(10)

28    1293
23     962
63     953
44     756
47     756
69     684
30     496
26     365
49     105
66      58
Name: category, dtype: int64

In [71]:
data['category'].value_counts(normalize=True).head() # посчитает разбивку в процентах

67    0.112583
27    0.082090
24    0.063164
42    0.053940
37    0.052255
Name: category, dtype: float64

### Упражнение
Используем файл transactions.csv. Определите какой товар (столбец Product) упоминается в файле чаще всего?

In [74]:
trans = pd.read_csv('transactions.csv')
trans['Product'].value_counts(normalize=True).head(1) # посчитает разбивку в процентах

_5    0.183333
Name: Product, dtype: float64

# Фильтры

In [75]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [76]:
# выбрать несколько столбцов

country_stats = data.filter(items = ['country', 'quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [77]:
# или так

data[['country', 'quantity']].head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

### Отфильтруем строки с потреблением выше среднего

In [78]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [79]:
'quantity > {}'.format(average_level)

'quantity > 184264.77005012965'

In [80]:
# строки с потреблением больше среднего

average_level = data['quantity'].mean()
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [83]:
# data[ ... ] # самый популярный способ фильтрации

In [84]:
# самый популярный способ

data[ data.quantity > average_level ].head()

            country  year  quantity  category
3228  United States  2014  367987.0         2
3229  United States  2013  384439.0         2
3230  United States  2012  370625.0         2
3231  United States  2011  310909.0         2
3232  United States  2010  335418.0         2

### Как определить используемый вариант названия страны?

In [85]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [86]:
# найдем как называется Россия и Беларусь в этом датафрейме
# фильтр на подстроку - смотрим все страны, содержащие в названии 'us'
# можно заценить для цб рф


data[ data['country'].str.contains('us', case=False) ]['country'].unique()

array(['Austria', 'Brunei Darussalam', 'Australia', 'Russian Federation',
       'USSR (former)', 'Mauritius', 'Belarus', 'Cyprus',
       'Bonaire, St Eustatius, Saba'], dtype=object)

In [91]:
# фильтр на несколько условий сразу
# | - условие ИЛИ
# & AND
# () | (() | () & ())
filtered_countries = data[ (data['country']=='Russian Federation') | (data['country']=='Belarus') ]

filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [92]:
filtered_countries['country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [95]:
# фильтры на номер строки

data.loc[1000:1005]

      country  year  quantity  category
1000  Austria  1998     -14.0         1
1001  Austria  1997       5.0         1
1002  Austria  1996      -1.0         1
1003  Austria  1995     -10.0         1
1004  Austria  1994      -8.0         1
1005  Austria  1993     -11.0         1

# Сортировка

In [103]:
# Сортировка по столбцу

data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [102]:
# сортировка по убыванию

data.sort_values('quantity', ascending=False).head()

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492345          China  2014  5.462672e+09        31
492047          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12

In [105]:
# сортировка по нескольким столбцам

data.sort_values(by=['country', 'year', 'quantity'], ascending=[False, True, False]).head(10)

         country  year   quantity  category
492605  Zimbabwe  1990  7355000.0        31
491540  Zimbabwe  1990  5820000.0        31
492291  Zimbabwe  1990  1535000.0        31
122097  Zimbabwe  1990   965000.0        12
122399  Zimbabwe  1990   965000.0        12
492003  Zimbabwe  1990   734000.0        31
957330  Zimbabwe  1990    75283.0        55
959523  Zimbabwe  1990    75283.0        55
962492  Zimbabwe  1990    75283.0        55
964131  Zimbabwe  1990    75283.0        55

### Параметр inplace

In [106]:
data.sort_values('country', ascending=True)

             country  year      quantity  category
835137   Afghanistan  1990  3.902100e+06        42
1108333  Afghanistan  2007  7.850000e+02        67
1083874  Afghanistan  2007  7.000000e+02        67
563378   Afghanistan  2007  6.840000e+02        33
1137175  Afghanistan  2007  6.790000e+02        67
374422   Afghanistan  2007  6.158340e+02        25
378283   Afghanistan  2007  6.158340e+02        25
245761   Afghanistan  2007  4.890000e+02        21
1161797  Afghanistan  2007  4.440000e+02        67
236450   Afghanistan  2007  3.740000e+02        21
240240   Afghanistan  2007  3.070000e+02        21
1045329  Afghanistan  2007  3.000000e+02        67
1053131  Afghanistan  2007  3.000000e+02        67
1066519  Afghanistan  2007  3.000000e+02        67
1133499  Afghanistan  2007  2.710000e+02        67
1032113  Afghanistan  2007  2.660000e+02        65
213690   Afghanistan  2007  2.470000e+02        21
518542   Afghanistan  2007  2.430000e+02        31
1116178  Afghanistan  2007  8.970000e+02        67
521827   Afghanistan  2007  2.430000e+02        31
357848   Afghanistan  2007  9.145760e+02        25
341789   Afghanistan  2007  9.145760e+02        25
325907   Afghanistan  2006  1.000000e+00        24
835129   Afghanistan  2007  1.951050e+06        42
491543   Afghanistan  2007  6.600000e+04        31
791308   Afghanistan  2007  6.282000e+03        42
797886   Afghanistan  2007  6.282000e+03        42
811500   Afghanistan  2007  6.282000e+03        42
813890   Afghanistan  2007  6.282000e+03        42
820571   Afghanistan  2007  6.282000e+03        42
...              ...   ...           ...       ...
959514      Zimbabwe  1999  8.722500e+04        55
962483      Zimbabwe  1999  8.722500e+04        55
964122      Zimbabwe  1999  8.722500e+04        55
966056      Zimbabwe  1999  8.722500e+04        55
967857      Zimbabwe  1999  8.722500e+04        55
369196      Zimbabwe  1999  1.560350e+04        25
374405      Zimbabwe  1999  1.560350e+04        25
357831      Zimbabwe  1999  1.545386e+04        25
362567      Zimbabwe  1999  1.545386e+04        25
346471      Zimbabwe  1999  1.498807e+04        25
338931      Zimbabwe  1999  1.370717e+04        25
1102793     Zimbabwe  1999  1.218800e+04        67
1097261     Zimbabwe  1999  1.078000e+04        67
1108316     Zimbabwe  1999  7.091000e+03        67
158088      Zimbabwe  1999  3.234000e+03        16
157218      Zimbabwe  1999  3.234000e+03        16
154731      Zimbabwe  1999  3.234000e+03        16
153757      Zimbabwe  1999  3.234000e+03        16
1155089     Zimbabwe  1999  3.817000e+03        67
1037585     Zimbabwe  1999  4.142000e+03        65
1146903     Zimbabwe  1998  2.730000e+02        67
519972      Zimbabwe  1999  4.626000e+03        31
1066502     Zimbabwe  1999  5.177000e+03        67
1110993     Zimbabwe  1999  5.275000e+03        67
1071210     Zimbabwe  1999  5.603000e+03        67
1057836     Zimbabwe  1999  5.603000e+03        67
1142681     Zimbabwe  1999  6.766000e+03        67
1121684     Zimbabwe  1999  6.913000e+03        67
524655      Zimbabwe  1999  4.663000e+03        31
871611      Zimbabwe  2014  0.000000e+00        48

[1189482 rows x 4 columns]

In [108]:
data = data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False])

# чтобы сократить это выражение используем inplace: перезапись результата.
data.sort_values(by=['country', 'year', 'quantity'], ascending=[True, True, False], inplace=True)

### Упражнение
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?